In [1]:
import pandas as pd
a = [1,7,2]
series = pd.Series(a)
print(series)

0    1
1    7
2    2
dtype: int64

In [2]:
data = {"calories":[420,320,390],"duration":[50,40,45]}
df = pd.DataFrame(data)
print(df)

   calories  duration
0       420        50
1       320        40
2       390        45

In [3]:
df.dropna()

   calories  duration
0       420        50
1       320        40
2       390        45

In [4]:
df["duration"].fillna(10)

0    50
1    40
2    45
Name: duration, dtype: int64

In [5]:
df.drop_duplicates()

   calories  duration
0       420        50
1       320        40
2       390        45

In [6]:
df.loc[:'duration']

   calories  duration
0       420        50
1       320        40
2       390        45

In [7]:
df.iloc[:3,:2]

   calories  duration
0       420        50
1       320        40
2       390        45

In [8]:
df['duration']

0    50
1    40
2    45
Name: duration, dtype: int64

In [9]:
data = ([9,4,8,9],[8,10,7,6],[7,6,8,5])
columns = ['maths', 'english', 'science', 'history']
df = pd.DataFrame(data, columns = columns)
df.groupby('maths').sum()
df.groupby('maths').mean()
df.agg(['min', 'max','mean'])

      maths    english   science   history
min     7.0   4.000000  7.000000  5.000000
max     9.0  10.000000  8.000000  9.000000
mean    8.0   6.666667  7.666667  6.666667

In [10]:
data1 = {'key':['k0','k1'], 'name': ['jai','anuj']}
data2 = {'key':['k0','k1'], 'city': ['delhi', 'mumbai']}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
pd.merge(df1, df2, on = 'key')

  key  name    city
0  k0   jai   delhi
1  k1  anuj  mumbai

In [11]:
df1.join(df2, lsuffix = '_left')

  key_left  name key    city
0       k0   jai  k0   delhi
1       k1  anuj  k1  mumbai

In [12]:
res= pd.concat([df1,df2])
print(res)

  key  name    city
0  k0   jai     NaN
1  k1  anuj     NaN
0  k0   NaN   delhi
1  k1   NaN  mumbai

In [13]:
data = {'name':['bob','alice','charlie'], 'age':[25,32,45], 'score':[80,90,78]}
df = pd.DataFrame(data)
filtered = df.loc[df['age'] > 30, ['name', 'score']]
print(filtered)

      name  score
1    alice     90
2  charlie     78

In [14]:
filtered = df[df['age'].isin([25,45])]
print(filtered)

      name  age  score
0      bob   25     80
2  charlie   45     78

In [15]:
filtered = df.query('age>30 and score<90')
print(filtered)

      name  age  score
2  charlie   45     78

In [16]:
filtered = df[(df['age']>25) & (df['score']> 80)]
filtered

    name  age  score
1  alice   32     90

In [17]:
df.sort_values(by=['age'], ascending=True, inplace= True)
df

      name  age  score
0      bob   25     80
1    alice   32     90
2  charlie   45     78